<?php
/*!
@file hinagata.php
@brief ページ作成の雛形ファイル
@copyright Copyright (c) 2024 Yamanoi Yasushi.
*/

//ライブラリをインクルード
require_once("common/libs.php");

$err_array = array();
$err_flag = 0;
$page_obj = null;


//--------------------------------------------------------------------------------------
///	本体ノード
//--------------------------------------------------------------------------------------
class cmain_node extends cnode {
	//--------------------------------------------------------------------------------------
	/*!
	@brief	コンストラクタ
	*/
	//--------------------------------------------------------------------------------------
	public function __construct() {
		//親クラスのコンストラクタを呼ぶ
		parent::__construct();
	}
	//--------------------------------------------------------------------------------------
	/*!
	@brief  本体実行（表示前処理）
	@return なし
	*/
	//--------------------------------------------------------------------------------------
	public function execute(){
	}
	//--------------------------------------------------------------------------------------
	/*!
	@brief	構築時の処理(継承して使用)
	@return	なし
	*/
	//--------------------------------------------------------------------------------------
	public function create(){
	}
	//--------------------------------------------------------------------------------------
	/*!
	@brief  表示(継承して使用)
	@return なし
	*/
	//--------------------------------------------------------------------------------------
	public function display(){
//PHPブロック終了
?>
<!-- コンテンツ　-->
	<div class="container">
        <h1>サービス概要</h1>
        <div class="header-box">
            <p>～もう行く場所で困らせない～</p>
        </div>

        <div class="section">
            <div class="image">
                <img src="http://150.95.36.201/~k2024d/image/場所を選択.jpg" alt="場所を選択">
            </div>
            <div class="text">
                <h2>1.ガチャを選択しよう！</h2>
                <p>地域と行きたい場所を選べるよ</p>
            </div>
        </div>

        <div class="section">
            <div class="image">
                <img src="http://150.95.36.201/~k2024d/image/ガチャを引く.jpg" alt="ガチャを引く">
            </div>
            <div class="text">
                <h2>2.ガチャを引こう！</h2>
                <p>ガチャを引いた後はスタンプ画面にいこう！</p>
            </div>
        </div>

        <div class="section">
            <div class="image">
                <img src="http://150.95.36.201/~k2024d/image/スタンプラリー.png" alt="スタンプラリー">
            </div>
            <div class="text">
                <h2>3.スタンプラリーをしよう！</h2>
                <p>スタンプを押すとポイントゲット！<br>特典と交換しよう！</p>
            </div>
        </div>
    </div>
<!-- /コンテンツ　-->
<?php 
//PHPブロック再開
	}
	//--------------------------------------------------------------------------------------
	/*!
	@brief	デストラクタ
	*/
	//--------------------------------------------------------------------------------------
	public function __destruct(){
		//親クラスのデストラクタを呼ぶ
		parent::__destruct();
	}
}

//ページを作成
$page_obj = new cnode();
//ヘッダ追加
$page_obj->add_child(cutil::create('cheader'));
//本体追加
$page_obj->add_child($main_obj = cutil::create('cmain_node'));
//フッタ追加
$page_obj->add_child(cutil::create('cfooter'));
//構築時処理
$page_obj->create();
//本体実行（表示前処理）
$main_obj->execute();
//ページ全体を表示
$page_obj->display();

?>
